app/Controllers/Api/Auth.php

    public function registration()
    {
        $success = false;
        $message = 'Gagal Proses Data';

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $phone = $this->request->getPost('phone');
        $name = $this->request->getPost('name');
        $roles = $this->request->getPost('roles');

        $builderUsers = $this->db->table('users');
        $builderUsers->where(['email' => $email,]);
        $queryUsers    =  $builderUsers->get();

        if (empty($queryUsers->getNumRows())) {
            $dataValues['email'] = $email;
            $dataValues['password'] = md5($password);
            $dataValues['name'] = $name;
            $dataValues['phone'] = $phone;
            $dataValues['roles'] = $roles;
            $tgl_buat = date('Y-m-d H:i:s');
            $dataValues['created_at'] = $tgl_buat;

            $builderInserts = $this->db->table('users');
            $insertDatas =  $builderInserts->insert($dataValues);
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
INSERT INTO `users` (`email`, `password`, `name`, `phone`, `roles`, `created_at`) VALUES ('admin@gmail.com', 'e66055e8e308770492a44bf16e875127', 'admin Alexd', '0826234234', '0', '2022-12-25 12:39:56')

    public function login()
    {
        $success = false;
        $message = 'Gagal Proses Data';

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $builderUsers = $this->db->table('users');
        $builderUsers->where(['email' => $email, 'password' => md5($password)])->select('*');
        $queryUsers    =  $builderUsers->get();
---
SELECT *
FROM `users`
WHERE `email` = 'ujang@gmail.com'
AND `password` = '2b3900a914a4b9af24c153a133b9ae9f'