app/Controllers/Api/Futsal.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
INSERT INTO `futsal` (`name`, `jumlah_lapangan`, `id_pengelola`, `alamat_lapangan`, `maps`, `created_at`) VALUES ('futsal po', '3', '2', 'JL samkas', 'ansjjasjas', '2022-12-25 13:11:47')
---
    public function insert_futsal()
    {
        $success = false;
        $message = 'Gagal Proses Data';

        $email = $this->request->getPost('email');
        $name = $this->request->getPost('name');
        $jumlah_lapangan = $this->request->getPost('jumlah_lapangan');
        $id_pengelola = $this->request->getPost('id_pengelola');
        $alamat_lapangan = $this->request->getPost('alamat_lapangan');
        $maps = $this->request->getPost('maps');
        $builderUsers = $this->db->table('users');
        $builderUsers->where(['email' => $email])->select('*');
        $queryUsers    =  $builderUsers->get();

        $rowUsers = $queryUsers->getRowArray();

        if ($rowUsers['roles'] == 0) {
            $dataValues['name'] = $name;
            $dataValues['jumlah_lapangan'] = $jumlah_lapangan;
            $dataValues['id_pengelola'] = $id_pengelola;
            $dataValues['alamat_lapangan'] = $alamat_lapangan;
            $dataValues['maps'] = $maps;
            $tgl_buat = date('Y-m-d H:i:s');
            $dataValues['created_at'] = $tgl_buat;

            $builderInserts = $this->db->table('futsal');
            $insertDatas =  $builderInserts->insert($dataValues);